In [1]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error

In [2]:
df=pd.read_csv("car data.csv")

In [3]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Driven_kms,Fuel_Type,Selling_type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [4]:
df.tail()

,Car_Name,Year,Selling_Price,Present_Price,Driven_kms,Fuel_Type,Selling_type,Transmission,Owner
296,city,2016,9.50,11.6,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.9,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.0,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.5,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.9,5464,Petrol,Dealer,Manual,0

In [5]:
df.shape

(301, 9)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Selling_Price  301 non-null    float64
 3   Present_Price  301 non-null    float64
 4   Driven_kms     301 non-null    int64
 5   Fuel_Type      301 non-null    object
 6   Selling_type   301 non-null    object
 7   Transmission   301 non-null    object
 8   Owner          301 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 21.3+ KB

In [7]:
df.describe()

              Year  Selling_Price  Present_Price     Driven_kms       Owner
count   301.000000     301.000000     301.000000     301.000000  301.000000
mean   2013.627907       4.661296       7.628472   36947.205980    0.043189
std       2.891554       5.082812       8.642584   38886.883882    0.247915
min    2003.000000       0.100000       0.320000     500.000000    0.000000
25%    2012.000000       0.900000       1.200000   15000.000000    0.000000
50%    2014.000000       3.600000       6.400000   32000.000000    0.000000
75%    2016.000000       6.000000       9.900000   48767.000000    0.000000
max    2018.000000      35.000000      92.600000  500000.000000    3.000000

In [8]:
df.isnull().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Driven_kms       0
Fuel_Type        0
Selling_type     0
Transmission     0
Owner            0
dtype: int64

In [9]:
la_name = LabelEncoder()
la_Ftype = LabelEncoder()
la_Stype = LabelEncoder()
la_tran = LabelEncoder()

In [10]:
df['Car_Name'] = la_name.fit_transform(df['Car_Name'])
df['Fuel_Type'] = la_Ftype.fit_transform(df['Fuel_Type'])
df['Selling_type'] = la_Stype.fit_transform(df['Selling_type'])
df['Transmission'] = la_tran.fit_transform(df['Transmission'])

In [11]:
df

,Car_Name,Year,Selling_Price,Present_Price,Driven_kms,Fuel_Type,Selling_type,Transmission,Owner
0,90,2014,3.35,5.59,27000,2,0,1,0
1,93,2013,4.75,9.54,43000,1,0,1,0
2,68,2017,7.25,9.85,6900,2,0,1,0
3,96,2011,2.85,4.15,5200,2,0,1,0
4,92,2014,4.60,6.87,42450,1,0,1,0
...,...,...,...,...,...,...,...,...,...
296,69,2016,9.50,11.60,33988,1,0,1,0
297,66,2015,4.00,5.90,60000,2,0,1,0
298,69,2009,3.35,11.00,87934,2,0,1,0
299,69,2017,11.50,12.50,9000,1,0,1,0
300,66,2016,5.30,5.90,5464,2,0,1,0

In [12]:
x = df.drop('Selling_Price', axis=1)

In [13]:
x

,Car_Name,Year,Present_Price,Driven_kms,Fuel_Type,Selling_type,Transmission,Owner
0,90,2014,5.59,27000,2,0,1,0
1,93,2013,9.54,43000,1,0,1,0
2,68,2017,9.85,6900,2,0,1,0
3,96,2011,4.15,5200,2,0,1,0
4,92,2014,6.87,42450,1,0,1,0
...,...,...,...,...,...,...,...,...
296,69,2016,11.60,33988,1,0,1,0
297,66,2015,5.90,60000,2,0,1,0
298,69,2009,11.00,87934,2,0,1,0
299,69,2017,12.50,9000,1,0,1,0
300,66,2016,5.90,5464,2,0,1,0

In [14]:
y = df['Selling_Price']

In [15]:
y

0       3.35
1       4.75
2       7.25
3       2.85
4       4.60
       ...
296     9.50
297     4.00
298     3.35
299    11.50
300     5.30
Name: Selling_Price, Length: 301, dtype: float64

In [16]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=43)

In [17]:
x_train

,Car_Name,Year,Present_Price,Driven_kms,Fuel_Type,Selling_type,Transmission,Owner
17,76,2016,10.79,43000,1,0,1,0
36,73,2015,7.20,48767,2,0,1,0
94,71,2008,22.78,89000,2,0,0,0
208,84,2017,8.10,3435,2,0,1,0
266,64,2014,7.00,35000,2,0,1,0
...,...,...,...,...,...,...,...,...
145,51,2012,0.81,19000,2,1,1,0
16,76,2015,10.79,41678,1,0,1,0
58,78,2014,6.80,39485,2,0,1,1
277,69,2015,13.60,21780,2,0,1,0
255,66,2012,5.35,53675,2,0,1,0

In [18]:
x_test

,Car_Name,Year,Present_Price,Driven_kms,Fuel_Type,Selling_type,Transmission,Owner
288,69,2015,13.60,34000,2,0,1,0
130,32,2017,0.87,11000,2,1,1,0
245,94,2012,9.40,71000,1,0,1,0
160,8,2011,0.95,24000,2,1,1,0
124,47,2012,1.75,11500,2,1,1,0
...,...,...,...,...,...,...,...,...
176,39,2011,1.05,30000,2,1,1,0
65,80,2014,6.95,45000,1,0,1,0
11,68,2015,10.38,51000,1,0,1,0
67,81,2010,20.45,59000,1,0,1,0
185,50,2008,0.58,1900,2,1,0,0

In [19]:
y_train

17     7.75
36     4.65
94     4.00
208    7.90
266    3.65
       ...
145    0.60
16     7.25
58     4.10
277    9.70
255    3.00
Name: Selling_Price, Length: 240, dtype: float64

In [20]:
y_test

288    8.40
130    0.75
245    5.20
160    0.45
124    0.95
       ...
176    0.35
65     4.75
11     6.85
67     9.25
185    0.25
Name: Selling_Price, Length: 61, dtype: float64

In [21]:
model = DecisionTreeRegressor()

In [22]:
model.fit(x_train, y_train)

DecisionTreeRegressor()

In [23]:
y_pred = model.predict(x_test)

In [24]:
y_pred

array([ 8.4 ,  0.6 ,  4.95,  0.45,  1.25,  7.2 ,  0.5 , 20.75,  7.75,
        0.5 ,  2.35, 20.75,  3.35,  3.51,  6.25,  1.15, 10.11,  2.75,
        6.45,  8.4 ,  2.5 ,  3.1 ,  3.35,  5.25, 18.  ,  7.05,  7.45,
        5.9 ,  5.85,  2.75,  0.45,  5.25, 11.25, 23.  ,  2.85,  0.75,
        8.4 ,  1.05,  0.6 ,  0.2 ,  0.35, 18.75,  6.15,  0.45,  0.3 ,
        3.65,  0.45,  1.35,  1.05,  3.1 ,  4.4 ,  2.25,  3.35,  6.4 ,
        1.15,  0.6 ,  0.45,  4.6 ,  7.45,  9.65,  0.4 ])

In [25]:
r2_score(y_test, y_pred)

0.9168882599697492

In [26]:
MAE = mean_absolute_error(y_test, y_pred)
MAE

0.6347540983606558

In [27]:
MSE = mean_squared_error(y_test, y_pred)
MSE

3.1578295081967216

In [28]:
RMSE = np.sqrt(MSE)
RMSE

1.7770282800779287